scripts/test_banks/halkbank.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="HesapEkstreOrtak" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsp:Policy wsu:Id="basicHttpEndpoint_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Lax/></wsp:Policy></sp:Layout><sp:IncludeTimestamp/></wsp:Policy></sp:TransportBinding><sp:SignedSupportingTokens xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:UsernameToken sp:IncludeToken="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy/IncludeToken/AlwaysToRecipient"><wsp:Policy><sp:WssUsernameToken10/></wsp:Policy></sp:UsernameToken></wsp:Policy></sp:SignedSupportingTokens><sp:Wss10 xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy/></sp:Wss10></wsp:All></wsp:ExactlyOne></wsp:Policy><wsp:Policy wsu:Id="basicHttpEndpoint1_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="https://webservice.halkbank.com.tr/HesapEkstreOrtakWS/HesapEkstreOrtak.svc?xsd=xsd0" namespace="http://tempuri.org/"/><xsd:import schemaLocation="https://webservice.halkbank.com.tr/HesapEkstreOrtakWS/HesapEkstreOrtak.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="https://webservice.halkbank.com.tr/HesapEkstreOrtakWS/HesapEkstreOrtak.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/HesapEkstreOrtakWS.Request"/><xsd:import schemaLocation="https://webservice.halkbank.com.tr/HesapEkstreOrtakWS/HesapEkstreOrtak.svc?xsd=xsd3" namespace="http://schemas.datacontract.org/2004/07/HesapEkstreOrtakWS.Response"/><xsd:import schemaLocation="https://webservice.halkbank.com.tr/HesapEkstreOrtakWS/HesapEkstreOrtak.svc?xsd=xsd4" namespace="https://webservice.halkbank.com.tr"/></xsd:schema></wsdl:types><wsdl:message name="IHesapEkstreOrtak_EkstreSorgulama_InputMessage"><wsdl:part name="parameters" element="tns:EkstreSorgulama"/></wsdl:message><wsdl:message name="IHesapEkstreOrtak_EkstreSorgulama_OutputMessage"><wsdl:part name="parameters" element="tns:EkstreSorgulamaResponse"/></wsdl:message><wsdl:message name="IHesapEkstreOrtak_BagliMusteriEkstreSorgulama_InputMessage"><wsdl:part name="parameters" element="tns:BagliMusteriEkstreSorgulama"/></wsdl:message><wsdl:message name="IHesapEkstreOrtak_BagliMusteriEkstreSorgulama_OutputMessage"><wsdl:part name="parameters" element="tns:BagliMusteriEkstreSorgulamaResponse"/></wsdl:message><wsdl:message name="IHesapEkstreOrtak_DekontSorgulama_InputMessage"><wsdl:part name="parameters" element="tns:DekontSorgulama"/></wsdl:message><wsdl:message name="IHesapEkstreOrtak_DekontSorgulama_OutputMessage"><wsdl:part name="parameters" element="tns:DekontSorgulamaResponse"/></wsdl:message><wsdl:message name="IHesapEkstreOrtakBasic_EkstreSorgulamaBasic_InputMessage"><wsdl:part name="parameters" element="tns:EkstreSorgulamaBasic"/></wsdl:message><wsdl:message name="IHesapEkstreOrtakBasic_EkstreSorgulamaBasic_OutputMessage"><wsdl:part name="parameters" element="tns:EkstreSorgulamaBasicResponse"/></wsdl:message><wsdl:message name="IHesapEkstreOrtakBasic_BagliMusteriEkstreSorgulamaBasic_InputMessage"><wsdl:part name="parameters" element="tns:BagliMusteriEkstreSorgulamaBasic"/></wsdl:message><wsdl:message name="IHesapEkstreOrtakBasic_BagliMusteriEkstreSorgulamaBasic_OutputMessage"><wsdl:part name="parameters" element="tns:BagliMusteriEkstreSorgulamaBasicResponse"/></wsdl:message><wsdl:message name="IHesapEkstreOrtakBasic_DekontSorgulamaBasic_InputMessage"><wsdl:part name="parameters" element="tns:DekontSorgulamaBasic"/></wsdl:message><wsdl:message name="IHesapEkstreOrtakBasic_DekontSorgulamaBasic_OutputMessage"><wsdl:part name="parameters" element="tns:DekontSorgulamaBasicResponse"/></wsdl:message><wsdl:portType name="IHesapEkstreOrtak"><wsdl:operation name="EkstreSorgulama"><wsdl:input wsaw:Action="http://tempuri.org/IHesapEkstreOrtak/EkstreSorgulama" message="tns:IHesapEkstreOrtak_EkstreSorgulama_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IHesapEkstreOrtak/EkstreSorgulamaResponse" message="tns:IHesapEkstreOrtak_EkstreSorgulama_OutputMessage"/></wsdl:operation><wsdl:operation name="BagliMusteriEkstreSorgulama"><wsdl:input wsaw:Action="http://tempuri.org/IHesapEkstreOrtak/BagliMusteriEkstreSorgulama" message="tns:IHesapEkstreOrtak_BagliMusteriEkstreSorgulama_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IHesapEkstreOrtak/BagliMusteriEkstreSorgulamaResponse" message="tns:IHesapEkstreOrtak_BagliMusteriEkstreSorgulama_OutputMessage"/></wsdl:operation><wsdl:operation name="DekontSorgulama"><wsdl:input wsaw:Action="http://tempuri.org/IHesapEkstreOrtak/DekontSorgulama" message="tns:IHesapEkstreOrtak_DekontSorgulama_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IHesapEkstreOrtak/DekontSorgulamaResponse" message="tns:IHesapEkstreOrtak_DekontSorgulama_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:portType name="IHesapEkstreOrtakBasic"><wsdl:operation name="EkstreSorgulamaBasic"><wsdl:input wsaw:Action="http://tempuri.org/IHesapEkstreOrtakBasic/EkstreSorgulamaBasic" message="tns:IHesapEkstreOrtakBasic_EkstreSorgulamaBasic_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IHesapEkstreOrtakBasic/EkstreSorgulamaBasicResponse" message="tns:IHesapEkstreOrtakBasic_EkstreSorgulamaBasic_OutputMessage"/></wsdl:operation><wsdl:operation name="BagliMusteriEkstreSorgulamaBasic"><wsdl:input wsaw:Action="http://tempuri.org/IHesapEkstreOrtakBasic/BagliMusteriEkstreSorgulamaBasic" message="tns:IHesapEkstreOrtakBasic_BagliMusteriEkstreSorgulamaBasic_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IHesapEkstreOrtakBasic/BagliMusteriEkstreSorgulamaBasicResponse" message="tns:IHesapEkstreOrtakBasic_BagliMusteriEkstreSorgulamaBasic_OutputMessage"/></wsdl:operation><wsdl:operation name="DekontSorgulamaBasic"><wsdl:input wsaw:Action="http://tempuri.org/IHesapEkstreOrtakBasic/DekontSorgulamaBasic" message="tns:IHesapEkstreOrtakBasic_DekontSorgulamaBasic_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IHesapEkstreOrtakBasic/DekontSorgulamaBasicResponse" message="tns:IHesapEkstreOrtakBasic_DekontSorgulamaBasic_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="basicHttpEndpoint" type="tns:IHesapEkstreOrtak"><wsp:PolicyReference URI="#basicHttpEndpoint_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="EkstreSorgulama"><soap:operation soapAction="http://tempuri.org/IHesapEkstreOrtak/EkstreSorgulama" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="BagliMusteriEkstreSorgulama"><soap:operation soapAction="http://tempuri.org/IHesapEkstreOrtak/BagliMusteriEkstreSorgulama" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="DekontSorgulama"><soap:operation soapAction="http://tempuri.org/IHesapEkstreOrtak/DekontSorgulama" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="basicHttpEndpoint1" type="tns:IHesapEkstreOrtakBasic"><wsp:PolicyReference URI="#basicHttpEndpoint1_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="EkstreSorgulamaBasic"><soap:operation soapAction="http://tempuri.org/IHesapEkstreOrtakBasic/EkstreSorgulamaBasic" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="BagliMusteriEkstreSorgulamaBasic"><soap:operation soapAction="http://tempuri.org/IHesapEkstreOrtakBasic/BagliMusteriEkstreSorgulamaBasic" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="DekontSorgulamaBasic"><soap:operation soapAction="http://tempuri.org/IHesapEkstreOrtakBasic/DekontSorgulamaBasic" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="HesapEkstreOrtak"><wsdl:port name="basicHttpEndpoint" binding="tns:basicHttpEndpoint"><soap:address location="https://webservice.halkbank.com.tr/HesapEkstreOrtakWS/HesapEkstreOrtak.svc/Basic"/></wsdl:port><wsdl:port name="basicHttpEndpoint1" binding="tns:basicHttpEndpoint1"><soap:address location="https://webservice.halkbank.com.tr/HesapEkstreOrtakWS/HesapEkstreOrtak.svc/SoapBasic"/></wsdl:port></wsdl:service></wsdl:definitions>